simulation/993-turbo-variants/cases/K16-24-HYBRID/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Version: 13
    \  /    A nd          |
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Generated from simulation/993-turbo-variants/variants.json.
// Variant: K16-24-HYBRID.
// The block is a rectangular equivalent diffuser, not K16 CAD.

convertToMeters 1;

vertices
(
        (0 -0.026 -0.026)
(0.09 -0.036 -0.036)
(0.09 0.036 -0.036)
(0 0.026 -0.026)
(0 -0.026 0.026)
(0.09 -0.036 0.036)
(0.09 0.036 0.036)
(0 0.026 0.026)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 24 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
